package com.company;

public class Patterns {
    ///Singleton
    // 1 инстанс у класса и приватный доступ к нему. через конструктор. файловая система, потокобезопасность.
//-----------------------
    ///Command
    //функция как обьект, ооп версия кол-бэка.
//-----------------------
    ///Flyweight
    //улучшение производительности. когда много сущностей, ренднрится один тип. для леса используется модель одного дерева.
//-----------------------
    ///Prototype
    //спавнит обьекты похожие на себя. ~полиморфизм.
//-----------------------
    ///Observer
    //на примере ачивок, реагирует на действия.
//-----------------------
    ///State
    //

    ///Strategy
    //сортировка разными сортировками
//-----------------------
    ///Decorator
    //

};

public class Algorythm {
    ///SORTING
    //Bubble sort
    //-----------------------
    //Selection sort
    //-----------------------
    //Insertion sort
    //-----------------------
    //Merge Sort

    ///SEARCHING
    //Linear Search
    //-----------------------
    //Binary Search

    //////-------------------

    //String Reverse Algorithm

    //////-------------------

    //Hashing algorithm (Caesar cipher)

    //////-------------------

    //Fibonacci sequence

    //////-------------------

    //Factorial Algorithm

}